tutorials/multiRegion/CHT/multiphaseCoolingCylinder2D/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc patchAverage
(
    name=cylinderToil,
    region=fluid,
    patch=fluid_to_solid,
    field=T.oil
)

#includeFunc patchAverage
(
    name=cylinderTwater,
    region=fluid,
    patch=fluid_to_solid,
    field=T.water
)

// ************************************************************************* //
